import { Section } from '@/components/Section';

export function EducationSection() {
  return (
    <Section>
      <h2>교육</h2>
      <h3>경민대학교 융합소프트웨어과 (4.5/4.5)</h3>
      <h4>창업 후 배움에 대한 열망</h4>
      <p>고등학교 때 창업을 경험한 후, 기술적인 부족함을 깨닫고 더 깊이 있는 개발 공부를 위해 대학교에 진학했습니다.</p>
      <p>
        학우들과 지식을 공유하며 함께 성장하고자 구름 사의 데벨업 클럽에 지원하여 학우들이 유료 강의를 무료로 수강할 수
        있게 했습니다. 하지만 이에 관심을 보이는 학우가 없었고 과제 및 시험 난이도가 하향 평준화된 점 등 여러 아쉬운
        부분들이 있어 편입하게 되었습니다.
      </p>
      <h3>성균관대학교 소프트웨어학과 (4.15/4.5)</h3>
      <h4>단기에 편입 합격</h4>
      <p>
        고등학교 시절 창업 등 진로 활동으로 기초에 부족함이 있어 편입을 선택하는 것은 쉽지 않았습니다. 그러나 도전하지
        않으면 아무것도 변하지 않는다고 생각해 도전했습니다. 능동적으로 공부하는 것을 좋아해 학원 대신 집에서 혼자
        인터넷 강의와 유튜브 등을 통해 공부했습니다. 주도적으로 공부한 결과 보통 1년을 준비하는 편입 시험을 6개월 만에
        합격했고, 이 과정에서 자기 주도적 학습 능력과 성장 마인드셋을 강화했습니다.
      </p>
      <h4>빠른 적응력과 컴퓨터 공학 역량 강화</h4>
      <p>
        편입 직후 개발 동아리에 가입하는 등 새로운 환경에 빠르게 적응하고 프론트엔드 개발을 다시 시작했습니다. 첫 학기에
        시스템 프로그램 개론과 컴퓨터 구조 개론을 들으며 컴퓨터 동작 과정을 더 이해할 수 있었습니다. 이후 xv6 운영체제,
        Linux Congestion Control Module, SimpleDB Buffer Manager 등을 개선하는 과제를 통해 오픈소스 소프트웨어 개선
        능력을 키웠습니다. 또한 HCI 개론, 기술경영 개론, 기계학습 원론을 수강하며 다양한 분야의 지식을 쌓고 시야를 넓혀
        나갔습니다.
      </p>
      <h4>성장 마인드셋과 함께 성장 추구</h4>
      <p>
        대부분이 성장 마인드셋을 가지고 열정적으로 활동하는 환경에서 만족스러운 학교생활을 하고 있습니다. 또한 학과
        선후배 웹 개발 부분 멘토와 신입생 대상 파이썬 사전 교육 조교를 수행하며 함께 성장하고자 노력하고 있습니다.
      </p>
      <h3>삼성전자 대학생 S/W 알고리즘 역량 강화 특강</h3>
      <h4>끊임없는 성장 욕구</h4>
      <p>
        취업 준비의 목적으로 알고리즘 공부를 하는 것을 넘어 문제 분석 및 해결 능력을 향상하고자 특강에 지원했습니다.
        성장하고자 하는 욕구로 열심히 준비하여 1:5의 경쟁률을 뚫고 입과 테스트에 통과했습니다.
      </p>
      <h4>성실한 참여 그리고 단기에 합격</h4>
      <p>
        매일 진행된 강의를 통해 Rabin-Karp, Trie, Segment tree와 같은 중급 알고리즘 및 문제 접근 방법을 배웠습니다.
        또한, 연습 문제 3개와 4시간이 걸리는 실전 문제 하나를 꾸준히 풀고 그 해결 방법을 분석하고 정리했습니다. 교육
        기간 도중 그리고 그 이후 총 두 번 사내 S/W 역량 테스트 응시 기회가 주어졌고, 성실하게 교육에 참여한 결과 교육
        도중에 합격할 수 있었습니다. 이 특강을 통해 문제의 핵심을 파악하고 상황에 맞는 해결책을 제시할 수 있는 역량을
        개발했습니다.
      </p>
    </Section>
  );
}
